# StairsRailingBalusterSpacingType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingBalusterSpacingType Property
ParameterTypeId Class See Also
---
"Baluster Spacing Type (Stair Railing Only)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingBalusterSpacingType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingBalusterSpacingType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingBalusterSpacingType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace